cases/case_0p8_ke/0/TauDNS
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
10981
(
(5.87662e-06 -1.37031e-07 0 9.04591e-08 0 3.66294e-06)
(2.24221e-05 -7.97139e-07 0 6.53856e-07 0 1.13182e-05)
(3.70628e-05 -1.51412e-06 0 1.31696e-06 0 1.6022e-05)
(6.22769e-05 -2.66383e-06 0 2.52946e-06 0 2.08415e-05)
(8.30136e-05 -3.40564e-06 0 3.63366e-06 0 2.62371e-05)
(8.87906e-05 -3.51421e-06 0 4.32332e-06 0 3.04532e-05)
(8.60674e-05 -3.23394e-06 0 5.04658e-06 0 3.5349e-05)
(7.17187e-05 -2.47822e-06 0 6.43907e-06 0 4.28323e-05)
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            zeroGradient;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
