cases/case_0p8_ke/0/UDNS
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
10981
(
(0.000495887 1.22887e-06 5.94002e-06)
(0.00221939 1.32119e-05 1.46139e-05)
(0.00402673 3.20834e-05 1.89831e-05)
(0.00791674 8.48782e-05 2.28635e-05)
(0.0127359 0.000239895 2.56204e-05)
(0.0162282 0.0004067 2.5636e-05)
(0.0195175 0.000629166 2.25051e-05)
(0.0234178 0.000991184 1.44399e-05)
...
(0.0176639 6.52451e-05 5.91277e-05)
(-nan 0 1.2732e-313)
(0.000926375 0.000631329 -1.15443e-06)
(0.00185688 0.00116542 -2.45307e-06)
(0.00259698 0.00150488 -4.14497e-06)
(0.00303362 0.0016855 -5.85979e-06)
(0.00356481 0.00189435 -7.87789e-06)
(0.00404185 0.00206741 -8.38791e-06)
(0.00435196 0.00218007 -7.88048e-06)
(0.00478349 0.00232341 -6.64152e-06)
(0.00507792 0.00241592 -5.17507e-06)
(0.00548375 0.00253393 -2.01387e-06)
(0.0058942 0.00264491 9.9969e-07)
(0.00630716 0.00274588 2.60599e-06)
(0.00658095 0.00281004 1.76057e-06)
(0.00698997 0.00289377 -3.08706e-06)
(0.00740017 0.00296644 -1.07695e-05)
(0.00781664 0.00302984 -1.91709e-05)
(0.00824588 0.00308534 -2.49944e-05)
(0.00868888 0.0031321 -2.5439e-05)
(0.009146 0.00317039 -2.00115e-05)
(0.00961684 0.00320032 -1.32124e-05)
(0.009937 0.00322253 -1.0679e-05)
(0.0104406 0.00323712 -5.25961e-06)
(0.0109603 0.00323985 1.89201e-06)
(0.0115015 0.00323189 1.36906e-05)
(0.0120667 0.0032153 2.63551e-05)
(0.0126527 0.00318753 3.63167e-05)
(0.013254 0.00314916 5.43213e-05)
(0.0140435 0.00307685 7.74097e-05)
(0.0146909 0.00301211 7.77192e-05)
(0.0153762 0.0029434 6.81201e-05)
(0.0160829 0.00286875 5.95252e-05)
(0.0168071 0.00278946 4.98266e-05)
(0.0175491 0.00270606 3.66409e-05)
(0.0183004 0.00261863 2.41605e-05)
(0.019049 0.00252353 5.62605e-06)
(0.0197953 0.0024257 -1.13146e-05)
(0.0205331 0.00232886 -2.19561e-05)
(0.0212609 0.0022336 -3.54253e-05)
(0.021785 0.00200281 -4.87048e-05)
(0.0224758 0.00192674 -4.24541e-05)
(0.0231256 0.00185142 -2.2403e-05)
(0.0237334 0.00177869 5.95353e-06)
(0.0242913 0.00170457 2.89621e-05)
(0.0247982 0.00162719 4.64627e-05)
(0.0252463 0.00154875 6.83015e-05)
(0.0256571 0.00147121 9.81714e-05)
(0.0260399 0.0013943 0.000121587)
(0.026258 0.00134643 0.000134953)
(0.0265578 0.00127209 0.000147229)
(0.0267269 0.00114692 0.000152356)
(0.026955 0.00107792 0.000155227)
(0.0271412 0.00101096 0.000157764)
(0.0272827 0.000946702 0.000157241)
(0.0273869 0.000886678 0.00015139)
(0.0274395 0.000848324 0.000146363)
(0.0274885 0.000794596 0.000142233)
(0.0274964 0.000742352 0.000137111)
(0.0274523 0.000693955 0.000126174)
(0.0273941 0.00066208 0.000117757)
(0.027265 0.000616302 0.000108491)
(0.0270817 0.000571788 9.92231e-05)
(0.0268421 0.000528205 8.65727e-05)
(0.0266846 0.000504242 7.96805e-05)
(0.0263684 0.000462423 7.03224e-05)
(0.0260064 0.000421136 6.32078e-05)
(0.0257996 0.000399692 6.00257e-05)
(0.0253764 0.000359679 5.52253e-05)
(0.025066 0.000330994 5.2646e-05)
(0.0245766 0.00029372 4.89733e-05)
(0.024306 0.000274656 4.77763e-05)
(0.0237382 0.000238062 4.80772e-05)
(0.0234157 0.000219397 4.95868e-05)
(0.0227055 0.000183721 5.4744e-05)
(0.0222759 0.00016555 5.7877e-05)
(0.0212581 0.000131009 6.25943e-05)
(0.0205911 0.000113595 6.35917e-05)
(0.0188647 8.10532e-05 6.18577e-05)
(0.0176655 6.52548e-05 5.88998e-05)
(0 1.41632 0)
(0.00117655 0.000729016 -3.98158e-06)
(0.00225635 0.00139041 -7.87675e-06)
(0.00312195 0.00191963 -1.24381e-05)
(0.00349809 0.00213307 -1.49446e-05)
(0.00411133 0.00244817 -1.85234e-05)
(0.00439211 0.0025847 -1.95446e-05)
(0.00488274 0.0027945 -1.9234e-05)
(0.00533568 0.00295687 -1.67705e-05)
(0.00557197 0.00303966 -1.46785e-05)
(0.00599675 0.0031693 -8.1972e-06)
(0.00641201 0.00328256 -9.66077e-07)
(0.00664732 0.00334411 2.11563e-06)
(0.00705585 0.00343416 5.16866e-06)
(0.00746397 0.0035135 5.4174e-06)
(0.00787294 0.00358029 9.86969e-07)
(0.0082894 0.00363717 -7.88249e-06)
(0.00871646 0.00368459 -1.40274e-05)
(0.0090134 0.00371591 -1.42686e-05)
(0.00946508 0.00374771 -1.14813e-05)
(0.00993249 0.0037716 -1.03251e-05)
(0.0104204 0.00378564 -9.90688e-06)
...
(0.018765 6.35263e-05 5.46579e-05)
(0 -nan 0)
(0.000704989 0.000664267 1.25196e-06)
(0.00351307 0.00294775 4.96619e-06)
(0.00559087 0.00443033 6.23601e-06)
(0.0068917 0.00525267 6.90182e-06)
(0.0073715 0.00552633 7.80986e-06)
(0.00810896 0.00594358 1.05883e-05)
(0.00866368 0.00623685 1.48187e-05)
(0.00913738 0.00645174 1.91078e-05)
(0.0103473 0.00729564 2.4246e-05)
(0.0107485 0.00739339 2.48632e-05)
(0.0109753 0.00746413 2.48279e-05)
(0.0113704 0.0075404 2.44397e-05)
(0.0117661 0.00758526 2.2978e-05)
(0.0121706 0.00759878 1.93985e-05)
(0.0125937 0.00761139 1.45153e-05)
(0.0130375 0.00760578 9.27951e-06)
(0.0134966 0.0075797 3.41221e-06)
(0.0139701 0.00752819 -2.9356e-06)
(0.0144555 0.00745731 -6.51615e-06)
(0.0149569 0.0073592 -3.7399e-06)
(0.0154744 0.00723803 5.66608e-06)
(0.0160061 0.0070922 1.61807e-05)
(0.0165475 0.00692138 2.35268e-05)
(0.0170898 0.00672203 2.8629e-05)
(0.0176271 0.00649609 3.57055e-05)
(0.0181658 0.00624921 4.64312e-05)
(0.0187018 0.00598264 5.94166e-05)
(0.0192305 0.00569997 7.15376e-05)
(0.0190713 0.00517018 7.52951e-05)
(0.0196442 0.00491318 6.21753e-05)
(0.0202176 0.00465275 4.40377e-05)
(0.0207928 0.00439324 3.03662e-05)
(0.0213591 0.00413716 1.09447e-05)
(0.0219171 0.00388865 -1.14692e-05)
(0.0224735 0.00364959 -2.18448e-05)
(0.0230226 0.0034219 -2.03941e-05)
(0.0235636 0.00320779 -1.76377e-05)
(0.0240928 0.003008 -2.09404e-05)
(0.0245984 0.00282214 -1.2273e-05)
(0.0250729 0.00264994 8.33768e-06)
(0.0255209 0.00249023 2.48529e-05)
(0.0259435 0.00233725 4.35952e-05)
(0.0263357 0.00219258 6.62249e-05)
(0.0266979 0.00205639 8.38327e-05)
(0.0270224 0.00192637 0.000101425)
(0.0273074 0.001801 0.000121641)
(0.0275587 0.00168101 0.000138565)
(0.0277859 0.00156799 0.000152061)
(0.0279042 0.00150743 0.000154922)
(0.0279433 0.00139537 0.000153185)
(0.0280971 0.00130022 0.000152211)
(0.0282119 0.00121034 0.0001525)
(0.0282883 0.00112479 0.000150633)
(0.0283183 0.00107614 0.000149699)
(0.0283371 0.000997275 0.000144832)
(0.0283154 0.000923915 0.000136937)
(0.028254 0.000855703 0.000127697)
(0.0281885 0.000812678 0.000120703)
(0.0280556 0.000751269 0.000109275)
(0.0278816 0.000692116 9.7483e-05)
(0.0277373 0.000652339 9.02496e-05)
(0.0275166 0.00060072 8.10875e-05)
(0.0272467 0.000547748 7.34282e-05)
(0.0270529 0.000514072 6.90334e-05)
(0.0267398 0.000465246 6.31229e-05)
(0.0263925 0.000416974 5.87765e-05)
(0.0261676 0.000388268 5.6878e-05)
(0.0257704 0.000341964 5.45128e-05)
(0.0255284 0.000316308 5.376e-05)
(0.0250621 0.000271958 5.37047e-05)
(0.0247825 0.00024859 5.42007e-05)
(0.0241889 0.000206727 5.57554e-05)
(0.0238213 0.00018543 5.68792e-05)
(0.023405 0.000164921 5.81689e-05)
(0.022396 0.000127163 6.00685e-05)
(0.0217304 0.00010871 5.99435e-05)
(0.020927 9.11188e-05 5.87585e-05)
(0.0187578 5.94443e-05 5.34315e-05)
(1.42836 0 0.257513)
(0.00098068 0.000670432 1.8923e-06)
(0.00375062 0.00269013 7.21452e-06)
(0.00614924 0.00458967 1.14687e-05)
(0.00768288 0.00584619 1.36486e-05)
(0.00837466 0.00632555 1.50524e-05)
(0.00910039 0.00677618 1.74174e-05)
(0.0096513 0.00707497 2.04028e-05)
(0.0101185 0.00728814 2.32311e-05)
(0.0105506 0.0074524 2.49713e-05)
(0.0109392 0.00754058 2.50231e-05)
(0.0113256 0.00762752 2.43557e-05)
(0.0115811 0.00767687 2.38105e-05)
(0.011973 0.00770948 2.20427e-05)
(0.0123761 0.00771808 1.84033e-05)
(0.0128023 0.00773298 1.34458e-05)
(0.0132463 0.00771922 8.30563e-06)
(0.0137071 0.00768825 2.15368e-06)
(0.0141826 0.0076307 -4.27256e-06)
(0.0146704 0.00755284 -6.97044e-06)
(0.0151767 0.0074466 -2.86235e-06)
(0.0156971 0.00731857 7.34063e-06)
...
(5.27902 0 0.00173481)
(0 -nan 0)
(0.00425269 0.00323369 9.29057e-06)
(0.00734611 0.00564454 1.60588e-05)
(0.0096339 0.00754527 2.07822e-05)
(0.0111527 0.00877169 2.33513e-05)
(0.0121586 0.00940046 2.41079e-05)
(0.0128215 0.00968863 2.32536e-05)
(0.0133872 0.00986834 2.17591e-05)
(0.01392 0.0100456 1.99322e-05)
(0.014396 0.0101628 1.80763e-05)
(0.0148319 0.0101011 1.57069e-05)
(0.0152545 0.0100133 1.32624e-05)
(0.0157169 0.00999653 1.07373e-05)
(0.0161622 0.0098997 8.26635e-06)
(0.0166167 0.00976464 5.99837e-06)
(0.0170774 0.00960797 3.80318e-06)
(0.0175442 0.00942777 2.34873e-06)
(0.0180071 0.00921186 3.27989e-06)
(0.0184777 0.0089715 7.4341e-06)
(0.0189448 0.00870786 1.21979e-05)
(0.0195744 0.0082649 1.41629e-05)
(0.0200189 0.00793795 1.40247e-05)
(0.0204543 0.00759287 2.16365e-05)
(0.0208727 0.00722405 3.65708e-05)
(0.021277 0.00684276 5.81528e-05)
(0.021665 0.00645649 7.23915e-05)
(0.0220362 0.00606946 7.20462e-05)
(0.0224039 0.00568944 6.09837e-05)
(0.0227704 0.00532111 4.3214e-05)
(0.0231345 0.0049686 2.86206e-05)
(0.0234976 0.00463083 1.96463e-05)
(0.0238565 0.00431266 5.41314e-06)
(0.0242153 0.00401412 -9.83083e-06)
(0.0245761 0.00373706 -2.24046e-05)
(0.0249402 0.00348141 -2.36359e-05)
(0.0253063 0.00324549 -1.66477e-05)
(0.0256786 0.00302766 -7.06826e-06)
(0.0260441 0.00282381 6.10847e-06)
(0.0263947 0.00263652 2.26594e-05)
(0.0267307 0.002465 4.24483e-05)
(0.0270451 0.00230527 6.24515e-05)
(0.0273437 0.00215674 8.03182e-05)
(0.0275409 0.00206104 9.12031e-05)
(0.0278035 0.00192945 0.000102451)
(0.0280387 0.00180482 0.000115696)
(0.0282499 0.00168636 0.000129544)
(0.0284358 0.00157289 0.000142666)
(0.0286015 0.00146572 0.000150945)
(0.0286906 0.0014053 0.000152676)
(0.0288147 0.00130879 0.00015398)
(0.0289078 0.00121697 0.000154781)
(0.0289701 0.00112953 0.000154333)
(0.0289982 0.00104625 0.000150245)
(0.0289977 0.00100267 0.000146005)
(0.028965 0.00092589 0.000136446)
(0.0287813 0.00086633 0.00012791)
(0.0287275 0.000828573 0.000122776)
(0.0285929 0.000760727 0.000112088)
(0.0284184 0.000696704 0.000101029)
(0.0283113 0.000663868 9.51377e-05)
(0.0280846 0.000604577 8.48886e-05)
(0.0278234 0.000547896 7.64279e-05)
(0.027671 0.000518576 7.24318e-05)
(0.0273641 0.00046532 6.58916e-05)
(0.0271901 0.00043787 6.31305e-05)
(0.0268432 0.000387792 5.88464e-05)
(0.0264701 0.000339635 5.53575e-05)
(0.0262598 0.000314916 5.42412e-05)
(0.0258308 0.000269866 5.4146e-05)
(0.0255819 0.000247004 5.49478e-05)
(0.0253133 0.000224805 5.5959e-05)
(0.0247229 0.000184344 5.7933e-05)
(0.0243552 0.0001641 5.89806e-05)
(0.0239354 0.000144619 5.98822e-05)
(0.0229164 0.000109374 6.0039e-05)
(0.0222259 9.22906e-05 5.88478e-05)
(0.0213842 7.62595e-05 5.67702e-05)
(0.0203528 6.13378e-05 5.39566e-05)
(0 0 0)
(0.428592 0 5.92281)
(0.00503862 0.00375111 9.07972e-06)
(0.0092046 0.00685833 1.65381e-05)
(0.0121432 0.0091 2.1549e-05)
(0.0138872 0.0103224 2.35853e-05)
(0.0148399 0.0107787 2.32469e-05)
(0.0154997 0.0110021 2.17584e-05)
(0.0160739 0.0111332 1.96939e-05)
(0.0164941 0.0111456 1.7304e-05)
(0.0168945 0.0111142 1.43031e-05)
(0.0172854 0.0110302 1.01767e-05)
(0.0176612 0.0109216 5.38406e-06)
(0.0182214 0.0107089 -6.00459e-07)
(0.01862 0.0105249 -2.27022e-06)
(0.0190332 0.0103235 -1.88735e-06)
(0.0194471 0.0100938 -1.15325e-06)
(0.0198638 0.00984139 -1.17808e-06)
(0.0202672 0.00951711 1.97876e-06)
(0.0206716 0.00919184 8.70195e-06)
(0.0210598 0.00883785 1.37913e-05)
(0.0214289 0.00845228 1.66293e-05)
(0.0217797 0.00804904 2.14534e-05)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
